custom-software-errors.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-07 Tue 16:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Higher quality errors for custom software.</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0, user-scalable=yes">
<meta http-equiv="Content-Security-Policy" content="style-src-elem 'self' https://wmealing.github.io;">
<link rel="stylesheet" href="index.css">
<meta name="author" content="Wade Mealing" />
<meta name="description" content="Seriously useful error messages" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Higher quality errors for custom software.</h1>
<div id="outline-container-orgdd44afc" class="outline-2">
<h2 id="orgdd44afc">Summary:</h2>
<div class="outline-text-2" id="text-orgdd44afc">
<p>
In-house business software is a very different beast; it is usually target-built to solve
a very specific problem.  Company bean counters encourage buying off-the-shelf software when it is
advertised to solve a problem. Sometimes the benefits of customized, specific software
can provide too much value, and the company can't turn away from those sweet productivity gains, so
custom software will be created.
</p>

<p>
Because the software is created with customized intent, the error messages presented to users can have
additional benefits that off-the-shelf software doesn't offer.  Business process backed error messages.
</p>

<p>
In the company I work at, these improved error helpers  are called "Wilbert-Hofmann" error messages.
It would be great to see these error types in wider use.
</p>
</div>
</div>
<div id="outline-container-orgae80ee8" class="outline-2">
<h2 id="orgae80ee8">Introduction</h2>
<div class="outline-text-2" id="text-orgae80ee8">
<p>
Effective resolution of errors plays a pivotal role in shaping the user experience within
software applications. The content of the messages, along with information, should not only
alert users of the problem  but also equip them with the necessary resources to
troubleshoot effectively, even in challenging scenarios.
</p>

<p>
Contrary to the notion that error messages are an "anti-pattern" indicative of weaknesses
in code or design, they serve as vital conduits of information for end users. Familiarity with error
messages and their corresponding well-known user-interaction patterns show how deeply engrained error
handling is.
</p>
</div>
<div id="outline-container-org6a538a3" class="outline-3">
<h3 id="org6a538a3">The basics.</h3>
<div class="outline-text-3" id="text-org6a538a3">
<p>
Rather than re-iterate what has already been said, Google has a very good course, in the <a href="https://developers.google.com/tech-writing/error-messages/error-handling">technical writing</a>
category, which focuses on writing better error messages. It also contains excellent advice for programmers
when generating errors for their users.
</p>

<p>
To paraphrase, the best errors are:
</p>

<ul class="org-ul">
<li>Deliver the best user experience.</li>
<li>Are actionable.</li>
<li>Are universally accessible.</li>
<li>Enable users to help themselves.</li>
<li>Reduce the support workload.</li>
<li>Enable faster resolution of issues.</li>
</ul>

<p>
The original course is aimed at writing software for general use, but if the software is intended
for use in a corporate setting, additional features can be added to error messages.
</p>

<p>
I would like to believe that a certain subset of users are capable of solving many problems they
run into, and are also able to help others who can run into the same problem.
</p>
</div>
</div>
</div>
<div id="outline-container-orgd437cf5" class="outline-2">
<h2 id="orgd437cf5">Improved example.</h2>
<div class="outline-text-2" id="text-orgd437cf5">
<p>
So, let's provide a before and after.  This particular example was chosen as a bland and boring
example so we wouldn't focus on the error itself.
</p>

<p>
Kept in ascii art to remove distractions and debate on how poor my CSS theming skills are.
</p>
</div>
<div id="outline-container-org71ec7ce" class="outline-3">
<h3 id="org71ec7ce">Before:</h3>
<div class="outline-text-3" id="text-org71ec7ce">
<pre class="example" id="orgb645034">
|--------------------------------------------------------------|
| ⚠️ Error:                                                     |
|                                                              |
| Loan applications can not continue without approval.         |
|                                                              |
| Approvals take between 2-3 business days after lodgement     |
|                                                              |
| Please contact the approvals team if this needs expedition   |
|                                                              |
|                                            [ CANCEL ] [ OK ] |
|                                                              |
|--------------------------------------------------------------|
</pre>
</div>
</div>
<div id="outline-container-orgff44dcb" class="outline-3">
<h3 id="orgff44dcb">After:</h3>
<div class="outline-text-3" id="text-orgff44dcb">
<pre class="example" id="org2f20009">
+------------------------------------------------------------------------+
| ⚠️ Error #90210C                                                        |
|                                                                        |
| Loan applications can not continue without approval.                   |
|                                                                        |
| Loan approvals take between 2-3 business days after lodgement          |
|                                                                        |
| Please contact the approvals team if this needs expedition             |
|                                                                        |
|                                                      [ CANCEL ] [ OK ] |
|                                                                        |
+------------------------------------------------------------------------+
| CrowdSourced Docs | Message the Approvals Team | Approvals Queue  | 📋 |
+------------------------------------------------------------------------+
</pre>

<p>
Each error condition should have at least 4 basic "error additions" not
seen in most traditional software.
</p>

<p>
The naming conventions need not match and should match the terminology and
tooling used in business; you should adjust accordingly.
</p>

<p>
&#x2013; CrowdSourced Docs.
</p>

<p>
This will not be the first thing that an end user reads. We 'all know' that
nobody wants to read documentation; however that doesn't mean that it won't
be used.
</p>

<p>
Making documentation immediately linked to this exact error means that new
users can get additional information on documentation and update documentation
when they find an answer.
</p>

<p>
In most cases, this could be a company wiki, but it may also be something built
into the program itself if offered.
</p>

<p>
For example:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>=<span style="font-style: italic;">"https://&lt;organization&gt;.com/documentation/&lt;error-code&gt;/"</span>&gt;
  Crowdsourced Docs.
&lt;/<span style="font-weight: bold;">a</span>&gt;
</pre>
</div>

<p>
&#x2013; Message the Approvals team (communicate with help).
</p>

<p>
This should be a direct link to the company's internal messaging platform; it may be Teams,
Slack, Discord, or email.   It really doesn't matter as long as it gets to the right people
who can help deal with this particular error.
</p>

<p>
Programmers may believe this is useless or could confuse end users;
however, having the team directly responsible for the resolution available can reduce the back
and forth of contacting the wrong team to solve the wrong problem.
</p>

<p>
For example, the hyperlink:
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>=<span style="font-style: italic;">"https://&lt;organization&gt;.slack.com/messages/&lt;channel&gt;/"</span>&gt;
Approvals Team Slack
&lt;/<span style="font-weight: bold;">a</span>&gt;
</pre>
</div>

<p>
If the approvals team is more focused on emails, this instead could be a link to a template "mailto" url.
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span style="font-weight: bold;">a</span> <span style="font-weight: bold; font-style: italic;">href</span>=<span style="font-style: italic;">"mailto:approvals@example.com?subject=This loan needs exposition&amp;body=Please expedite loan id: 12345 because [insert reason here] "</span>&gt;Email approvals&lt;/<span style="font-weight: bold;">a</span>&gt;
</pre>
</div>

<p>
When clicked, the browser will fire the mailto protocol handler (mail program) with part of the template already filled out.
</p>

<p>
It doesn't have to be the approvals team, but if there is a support team that deals with the specific area, contact information should be here.
</p>

<p>
&#x2013; Approvals Queue ( Advanced Information )
</p>

<p>
This is the "why" of the error condition.  This is the part that we as programmers try to
hide from the user, however, I believe that for anything but the most basic of users, hiding
the logic behind why errors occur is a net loss.
</p>

<p>
For example, if there are several conditions that are not met in the approval process, but
you are also waiting for someone to approve the loan, this logic could be outlined.
</p>

<p>
Knowing the position in the queue, may mean they can re-prioritize work or understand if there
is no progress being made at all (Approvals people are on holiday).  Exactly what this is will
depend on the error.
</p>

<p>
&#x2013; The 📋 "Copy error to Clipboard" button (share this with someone helping)
</p>

<p>
Having the exact error message available with single click can reduce the
time to resolution. Without a simple way to copy and share errors, users will take poor
screenshots, incorrectly type out the message, or take photos of it with their phone camera
(including company confidential data).
</p>

<p>
Additional data to aid in resolution can be included in this clipboard to help someone
attempting to diagnose the problem, such as the <i>loan ID</i>, the <i>user ID</i> or <i>permissions</i>.  If a
user's question could be solved with additional data, this is where the data should be included.
</p>

<p>
Exactly how to do this will depend on the platform being used, and in the worst-case scenario,
you can present the text to be copied to a clipboard if the underlying toolchain does not
support this functionality.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb7d9541" class="outline-2">
<h2 id="orgb7d9541">Introducing change</h2>
<div class="outline-text-2" id="text-orgb7d9541">
<p>
Rolling changes like this into an existing code base will likely be complicated; one possible
solution is incremental improvements.
</p>

<p>
Areas to start with can be identified either through application telemetry (i.e., how often
users view error messages) or by talking to support staff and dealing with the  most frequent
offenders.
</p>
</div>
<div id="outline-container-org133b86b" class="outline-3">
<h3 id="org133b86b">Incremental Improvements</h3>
<div class="outline-text-3" id="text-org133b86b">
<p>
Incremental improvement of error messages involves advancing beyond basic error handling.  Not
all error conditions will benefit from the additional information. However, if there is an "error
display widget" used consistently in software, extending this widget to show this additional
data would be a great place to start.
</p>
</div>
</div>
<div id="outline-container-org011bda0" class="outline-3">
<h3 id="org011bda0">Error Categories.</h3>
<div class="outline-text-3" id="text-org011bda0">
<p>
Introducing a common "error category" simplifies the initial rollout of the new error fields. By
grouping related issues, error categories provide a simplified reference point, facilitating
collaboration and solution-sharing through wiki pages or discussion forums.
</p>

<p>
While there are effective categories for common errors, error categories alone are insufficient for
addressing complex or unique issues. Complex errors should be supplemented with robust reporting
and proactive problem-solving approaches addressing the specific issue.
</p>
</div>
</div>
<div id="outline-container-orgf008eb0" class="outline-3">
<h3 id="orgf008eb0">Unique Error Identifier</h3>
<div class="outline-text-3" id="text-orgf008eb0">
<p>
By assigning distinct identifiers to each error condition, developers establish
a standardized method for identifying, tracking, and managing errors throughout the
software lifecycle. This systematic approach enhances the clarity and precision of error
reporting, enabling developers and users alike to pinpoint specific issues swiftly and
accurately.
</p>

<p>
Unique identifiers allow customers to quickly identify issues for support teams. When confronted
with an error, users can quickly reference the unique identifier to access relevant documentation,
seek assistance, or contribute to discussions regarding the resolution.
</p>

<p>
If the condition that creates the error is changed, new unique identifiers should be
used so that existing documentation doesn't contain out of date information.  Do not
allow for unique identifiers to be duplicated across products unless they both
use the same source code with no variance.
</p>
</div>
</div>
<div id="outline-container-orgee00a40" class="outline-3">
<h3 id="orgee00a40">Online References (hyperlinks)</h3>
<div class="outline-text-3" id="text-orgee00a40">
<p>
This is more than just linking to a wiki page; error pages could link to specific URI's of company
resources such as Slack, shared drives, or source repositories.  If your userbase is sufficiently
technical it can also be a link to the source code for more capable users to self-diagnose the root cause.
</p>
</div>
</div>
<div id="outline-container-org6fea738" class="outline-3">
<h3 id="org6fea738">Extending this idea.</h3>
<div class="outline-text-3" id="text-org6fea738">
<p>
I consider these 4 basics to be the first generation of improvements. You will find new
and useful improvements; do not be afraid to use them.
</p>

<p>
These  "Wilbert-Hofmann" error messages are used heavily in the group of the company where I <a href="https://gitlab.com/cki-project/kernel-workflow/">work</a>.
</p>
</div>
</div>
<div id="outline-container-org303613b" class="outline-3">
<h3 id="org303613b">Generating documentation from error conditions for support staff.</h3>
<div class="outline-text-3" id="text-org303613b">
<p>
Software should generate a list of error codes and their reasons for any of the support
staff who may be dealing with the area of code.
</p>

<p>
They could also use this to point to the area of code for additional inspection.
</p>

<p>
Should be notified of new error codes and if existing codes are removed or deprecated.
</p>
</div>
</div>
<div id="outline-container-orgd5660c5" class="outline-3">
<h3 id="orgd5660c5">Error analysis.</h3>
<div class="outline-text-3" id="text-orgd5660c5">
<p>
Analysis of the error messages
</p>

<ul class="org-ul">
<li>Count the number of times error links are visited.</li>
<li>Statistics on resolution or continued workflow.</li>
<li>Highlight staff training opportunties.</li>
<li>Determine areas where the user interface could be improved.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgb3028ac" class="outline-2">
<h2 id="orgb3028ac">Conclusion</h2>
<div class="outline-text-2" id="text-orgb3028ac">
<p>
The suggestions presented in this document serve as fundamental examples of extending common error
conditions to enhance the user experience and streamline error management. However, it's essential for
readers to recognize that these suggestions represent just the beginning.
</p>

<p>
When implementing these strategies, consider incorporating any additional resources and tools
that are relevant to the specific context of their errors. By continually expanding and refining
their error-handling capabilities, developers can ensure robust and effective error management within
their software systems.
</p>
</div>
</div>
<div id="outline-container-org3e1c3df" class="outline-2">
<h2 id="org3e1c3df">Resources:</h2>
<div class="outline-text-2" id="text-org3e1c3df">
<p>
<a href="https://www.smashingmagazine.com/2022/08/error-messages-ux-design/">https://www.smashingmagazine.com/2022/08/error-messages-ux-design/</a>
<a href="https://www.linkedin.com/pulse/how-write-good-error-messages-saadia-minhas">https://www.linkedin.com/pulse/how-write-good-error-messages-saadia-minhas</a>
<a href="https://uxwritinghub.com/error-message-examples/">https://uxwritinghub.com/error-message-examples/</a>
<a href="https://gitlab.com/cki-project/kernel-workflow/">https://gitlab.com/cki-project/kernel-workflow/</a>
</p>
</div>
</div>
</div>
</body>
</html>
